{
    "format": "tfjs-layers",
    "generatedBy": "TensorFlow.js v2.0.1",
    "convertedBy": "TensorFlow.js Converter",
    "modelTopology": {
      "keras_version": "2.2.4",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential_1",
          "layers": [
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 8,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                }
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": "float32",
                "units": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                }
              }
            }
          ]
        }
      }
    },
    "weightsManifest": [
      {
        "paths": ["model-weights.bin"],
        "weights": [
          {
            "name": "dense_1/kernel",
            "shape": [8, 4],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [8],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [1, 8],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [1],
            "dtype": "float32"
          }
        ]
    }
    ]
}
  